{"id":670,"date":"2013-02-07T07:07:02","date_gmt":"2013-02-07T07:07:02","guid":{"rendered":"http:\/\/www.transez-nigeria.com\/?page_id=670"},"modified":"2021-01-23T19:10:48","modified_gmt":"2021-01-23T19:10:48","slug":"team","status":"publish","type":"page","link":"http:\/\/www.transez-nigeria.com\/about-transez\/team\/","title":{"rendered":"Meet Our Team"},"content":{"rendered":"<p style=\"text-align: justify;\"><b>Engr. CHUKA OKORO, MNSE (MANAGING PARTNER and CEO) <\/b><\/p>\n<p style=\"text-align: justify;\">Chuka Okoro is an Industrial and Production Engineering graduate from the University of Ibadan, a post graduate of Electrical Engineering from the University of Lagos with over a decade of experience in the field of power quality, facility design, control and protection engineering.<\/p>\n<p style=\"text-align: justify;\">He started his career as process engineering intern with Nigerite Nigeria Limited. He later moved on to BSN Nigeria Limited were he honed his project management skills as a project coordinator. At BSN, he was appointed project lead for numerous multi-million dollar projects. He has since worked for Bank PHB Plc as a project lead before was appointed as Managing Partner for Transez Nigeria Limited in 2005.<\/p>\n<p style=\"text-align: justify;\">He is a registered Engineer with the Council for the Regulation of Engineers in Nigeria (COREN) as well as being a PMI certified Project Management Professional. He was the Branch Treasurer of the Nigerian Society of Engineers and a member of the Nigerian Institute of Management, the National Institute of Electrical Engineers and the Nigerian Institute of Mechanical Engineers. He has trained with IBFC Augusto on Risk Management, with Elspec Limited Israel on Power Quality Management and with DEHN + SOHNE Training Institute on Lightning Protection Systems.<\/p>\n<p style=\"text-align: justify;\">He is happily married with three children.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><b>ADEDEJI OLABOWALE, MNSE (MANAGING PARTNER and DIRECTOR)<\/b><\/p>\n<p style=\"text-align: justify;\">Adedeji&nbsp;is an Electrical Engineering graduate from the University of Ibadan and a thoroughbred professional, with over 15 years of experience spanning various aspects of the construction, oil &amp; gas and fast moving consumer\/electronic goods industries in Africa and Europe.<\/p>\n<p style=\"text-align: justify;\">A member of the Nigerian Society of Engineers (NSE) and the National Institute of Electrical Engineers, he was at various times; Field Analyst at Halliburton Energy Services Limited, Senior Engineer at BSN Nigeria Ltd, and as Principal Partner at Upgrade Technologies Limited. With the experience gathered, he joined to revive Transez in 2005 and morphed the company’s business direction towards total power quality.<\/p>\n<p style=\"text-align: justify;\">Adedeji&nbsp;is a PMI certified project manager and a Chartered Energy Auditor. He is happily married and blessed with children<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\"><b>OLAMIDE&nbsp;MODELE, (GM; LOGISTICS AND OPERATIONS)<\/b><\/p>\n<p>Olamide is an experienced shipping and logistics professional who&#8217;s career cuts across a number of local and multinational players in the shipping, logistics and product service industries.<\/p>\n<p>He has applied himself in some of the most dynamic, innovative, customer service driven, wealth maximizing and responsible Corporate over the past 10 years gathering core competencies that cover the full spectrum of shipping, Logistics, human relationship management &amp; business analysis which has been put into optimal use. He is customer driven, giving the client excellent customer service and would never leave until every single client is 100% satisfied.<\/p>\n<p>Olamide’s background includes 10+ years of selling and product development in the logistics, construction, M&amp;E systems, earthing science, power protection applications. He has a B.Sc degree in Philosophy from the University of Lagos and also holds a certificate in Accounting from the Lagos City Polythecnic.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\"><b><\/b><b>AUGUSTINE EDEMA, (HEAD, ADMINISTRATIONS)<\/b><\/p>\n<p style=\"text-align: justify;\">With a B.Sc degree in Business Administration &nbsp;from the University Of &nbsp;Lagos, Augustine honed his skills in business development when he started his career with Computelink, Ikeja in 2001.<\/p>\n<p style=\"text-align: justify;\">He later moved on to, Geo Okaekwu &amp; Sons in 2003 and rose to the position of Account Manager, with the responsibility for West Africa markets in 2004. From there he joined Transez as the Head of Business Development also in 2005.<\/p>\n<p style=\"text-align: justify;\">He is a member of the National Institute of Marketing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Engr. CHUKA OKORO, MNSE (MANAGING PARTNER and CEO) Chuka Okoro is an Industrial and Production Engineering graduate from the University of Ibadan, a post graduate of Electrical Engineering from the University of Lagos with over a decade of experience in the field of power quality, facility design, control and protection engineering. He started his career [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":608,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":{"ngg_post_thumbnail":0},"_links":{"self":[{"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/pages\/670"}],"collection":[{"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/comments?post=670"}],"version-history":[{"count":36,"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/pages\/670\/revisions"}],"predecessor-version":[{"id":1590,"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/pages\/670\/revisions\/1590"}],"up":[{"embeddable":true,"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/pages\/608"}],"wp:attachment":[{"href":"http:\/\/www.transez-nigeria.com\/wp-json\/wp\/v2\/media?parent=670"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}